In [1]:
import numpy as np
import pandas as pd

In [3]:
d1={'name':['Deepthi','jhansi','geetha','shrunga','nethra','prasanna','sanju','vishu','darshu','sudeep'],
   'age':[20,22,23,18,27,18,23,19,20,24],
   'class':['MCA','MBA','MSc','MCom','MA','MCA','MBA','MS','MTech','ME'],
   'marks':[100,99,98,92,36,25,66,84,90,45]}

In [5]:
d1

{'name': ['Deepthi',
  'jhansi',
  'geetha',
  'shrunga',
  'nethra',
  'prasanna',
  'sanju',
  'vishu',
  'darshu',
  'sudeep'],
 'age': [20, 22, 23, 18, 27, 18, 23, 19, 20, 24],
 'class': ['MCA',
  'MBA',
  'MSc',
  'MCom',
  'MA',
  'MCA',
  'MBA',
  'MS',
  'MTech',
  'ME'],
 'marks': [100, 99, 98, 92, 36, 25, 66, 84, 90, 45]}

In [7]:
df=pd.DataFrame(d1)

In [8]:
df

       name  age  class  marks
0   Deepthi   20    MCA    100
1    jhansi   22    MBA     99
2    geetha   23    MSc     98
3   shrunga   18   MCom     92
4    nethra   27     MA     36
5  prasanna   18    MCA     25
6     sanju   23    MBA     66
7     vishu   19     MS     84
8    darshu   20  MTech     90
9    sudeep   24     ME     45

In [9]:
df["name"]

0     Deepthi
1      jhansi
2      geetha
3     shrunga
4      nethra
5    prasanna
6       sanju
7       vishu
8      darshu
9      sudeep
Name: name, dtype: object

In [10]:
df.head(4)

      name  age class  marks
0  Deepthi   20   MCA    100
1   jhansi   22   MBA     99
2   geetha   23   MSc     98
3  shrunga   18  MCom     92

In [11]:
df.tail(4)

     name  age  class  marks
6   sanju   23    MBA     66
7   vishu   19     MS     84
8  darshu   20  MTech     90
9  sudeep   24     ME     45

In [13]:
df.index=['Zero','One','Two','Three','Four','Five','Six','Seven','Eight','Nine']

In [14]:
df

           name  age  class  marks
Zero    Deepthi   20    MCA    100
One      jhansi   22    MBA     99
Two      geetha   23    MSc     98
Three   shrunga   18   MCom     92
Four     nethra   27     MA     36
Five   prasanna   18    MCA     25
Six       sanju   23    MBA     66
Seven     vishu   19     MS     84
Eight    darshu   20  MTech     90
Nine     sudeep   24     ME     45

In [15]:
df.describe()

            age       marks
count  10.00000   10.000000
mean   21.40000   73.500000
std     2.91357   28.488789
min    18.00000   25.000000
25%    19.25000   50.250000
50%    21.00000   87.000000
75%    23.00000   96.500000
max    27.00000  100.000000

In [20]:
newdf=pd.read_csv("emp.csv")

In [21]:
newdf

  Unnamed: 0 Unnamed: 1 Unnamed: 2
0       name        age        sal
1        abc         28       8000
2        xyz         35      16000
3        opq         33      50000
4        uvw         50     100000

In [22]:
newdf.columns

Index(['Unnamed: 0', 'Unnamed: 1', 'Unnamed: 2'], dtype='object')

In [23]:
newdf.T

               0     1      2      3       4
Unnamed: 0  name   abc    xyz    opq     uvw
Unnamed: 1   age    28     35     33      50
Unnamed: 2   sal  8000  16000  50000  100000

In [27]:
newdf.loc[0,"name"]="abc"

In [28]:
newdf

  Unnamed: 0 Unnamed: 1 Unnamed: 2 name
0       name        age        sal  abc
1        abc         28       8000  NaN
2        xyz         35      16000  NaN
3        opq         33      50000  NaN
4        uvw         50     100000  NaN

In [29]:
newdf.columns=list("ABC")

ValueError: Length mismatch: Expected axis has 4 elements, new values have 3 elements